In [3]:
import pandas as pd
import numpy as np

In [4]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

# 滤除缺失数据

In [5]:
 from numpy import nan as NA
 data = pd.Series([1, NA, 3.5, NA, 7])

In [6]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [7]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [8]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA, NA, NA], [NA, 6.5, 3.]])

cleaned = data.dropna()

data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [9]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [10]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [11]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [12]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [13]:
df = pd.DataFrame(np.random.randn(7, 3))

df.iloc[:4, 1] = NA

df.iloc[:2, 2] = NA

df

          0         1         2
0  0.678069       NaN       NaN
1 -2.020414       NaN       NaN
2  2.244954       NaN  0.123292
3 -2.179666       NaN  2.000985
4 -0.142570  0.639758  0.149529
5  0.348236 -0.199549  1.601069
6 -0.314882  1.324368 -0.315571

In [14]:
df.dropna(thresh=2)

          0         1         2
2  2.244954       NaN  0.123292
3 -2.179666       NaN  2.000985
4 -0.142570  0.639758  0.149529
5  0.348236 -0.199549  1.601069
6 -0.314882  1.324368 -0.315571

In [15]:
df.dropna()

          0         1         2
4 -0.142570  0.639758  0.149529
5  0.348236 -0.199549  1.601069
6 -0.314882  1.324368 -0.315571

# 填充缺失数据

In [16]:
df.fillna(0)

          0         1         2
0  0.678069  0.000000  0.000000
1 -2.020414  0.000000  0.000000
2  2.244954  0.000000  0.123292
3 -2.179666  0.000000  2.000985
4 -0.142570  0.639758  0.149529
5  0.348236 -0.199549  1.601069
6 -0.314882  1.324368 -0.315571

In [17]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  0.678069  0.500000  0.000000
1 -2.020414  0.500000  0.000000
2  2.244954  0.500000  0.123292
3 -2.179666  0.500000  2.000985
4 -0.142570  0.639758  0.149529
5  0.348236 -0.199549  1.601069
6 -0.314882  1.324368 -0.315571